{
    "actionTitle": {
        "message": "Baixar mídia",
        "description": "The contents of the context menu when hovering over the extension icon."
    },
    "extensionDescription": {
        "message": "Baixe vídeos, músicas e transmissões ao vivo no seu dispositivo!",
        "description": "The description of the extension shown in the browser's settings page."
    },
    "errorTitle1": {
        "message": "Algo deu errado!",
        "description": "The 1st title of the error popup, randomly selects one of the titles when there is an error."
    },
    "errorTitle2": {
        "message": "Ups!",
        "description": "The 2nd title of the error popup."
    },
    "errorTitle3": {
        "message": "Uh oh!",
        "description": "The 3rd title of the error popup."
    },
    "errorTitle4": {
        "message": "Erro!",
        "description": "The 4th title of the error popup."
    },
    "errorTitle5": {
        "message": "Eee quebrou!",
        "description": "The 5th title of the error popup."
    },
    "errorTitle6": {
        "message": "Essa não!",
        "description": "The 6th title of the error popup."
    },
    "reportIssue": {
        "message": "Relatar problema",
        "description": "The text of the link to report an issue in the error popup."
    },
    "okButton": {
        "message": "OK",
        "description": "The text of the OK button in the error popup."
    },
    "requestText": {
        "message": "Solicitação $METHOD$ de $SOURCE$ at $TIME$",
        "description": "The text showing which type of request is being made to load the media.",
        "placeholders": {
            "METHOD": {
                "content": "$1",
                "example": "GET"
            },
            "SOURCE": {
                "content": "$2",
                "example": "https://example.com/video.mp4"
            },
            "TIME": {
                "content": "$3",
                "example": "12:34"
            }
        }
    },
    "requestMethodUnknown": {
        "message": "Desconhecido",
        "description": "The text shown when the request method is not recognized."
    },
    "requestSourceUnknown": {
        "message": "fonte desconhecida",
        "description": "The text shown when the request source is not recognized."
    },
    "sizeText": {
        "message": "Tamanho",
        "description": "The text above the size selector in the media list."
    },
    "copyURL": {
        "message": "Copiar URL",
        "description": "The text of the button to copy the media URL to clipboard."
    },
    "URLCopyError": {
        "message": "Falha ao copiar URL para a área de transferência",
        "description": "The error message shown when the URL copy operation fails."
    },
    "previewMedia": {
        "message": "Pré-visualizar",
        "description": "The text of the preview button in the media list."
    },
    "downloadMedia": {
        "message": "Baixar",
        "description": "The text of the download button in the media list."
    },
    "endOfMediaList": {
        "message": "Foi tudo o que conseguimos encontrar! Se você não encontrar a mídia que procura, tente iniciá-la e atualizar a lista. Se ainda assim não a encontrar, altere o método de detecção de mídia nas configurações.",
        "description": "The text shown at the end of the media list in the popup."
    },
    "listLoadError": {
        "message": "Erro ao recuperar solicitações de mídia. Aqui está o que deu errado: $ERROR$",
        "description": "The error message shown when the media list fails to load.",
        "placeholders": {
            "ERROR": {
                "content": "$1",
                "example": "Network error"
            }
        }
    },
    "listClearError": {
        "message": "Erro ao limpar a lista de mídia. Aqui está o que deu errado: $ERROR$",
        "description": "The error message shown when the media list fails to clear.",
        "placeholders": {
            "ERROR": {
                "content": "$1",
                "example": "Network error"
            }
        }
    },
    "unknownSize": {
        "message": "Tamanho desconhecido",
        "description": "The text shown when the size of the media can't be parsed."
    },
    "downloadError": {
        "message": "Erro ao baixar a mídia. Aqui está o que deu errado: $ERROR$",
        "description": "The error message shown when the media download fails.",
        "placeholders": {
            "ERROR": {
                "content": "$1",
                "example": "Network error"
            }
        }
    },
    "homeTab": {
        "message": "Inicial",
        "description": "The name of the home tab in the popup."
    },
    "settingsTab": {
        "message": "Configurações",
        "description": "The name of the settings tab in the popup."
    },
    "clearListButton": {
        "message": "Limpar lista",
        "description": "The label of the button to clear the media list."
    },
    "refreshListButton": {
        "message": "Atualizar lista",
        "description": "The label of the button to refresh the media list."
    },
    "detectionMethodTitle": {
        "message": "Método de detecção",
        "description": "The title of the detection method section in the settings tab."
    },
    "needToRefreshListWarning": {
        "message": "⚠️ Após alterar isso, clique em \"Atualizar lista\" para ver as alterações!",
        "description": "The warning shown below the detection method title in the settings tab."
    },
      "detectionDisabledExplanation": {
        "message": "Desmarcar ambas as opções não filtrará nada, mostrando todas as solicitações (mesmo as que não são de mídia!) do navegador da web.",
        "description": "The explanation on how disabling detection works, shown in the settings tab"
    },
    "urlDetectionExplain": {
        "message": "Detecção por verificar se a URL contém um tipo de mídia conhecido (por exemplo, .mp4, .m3u8). É rápido, mas alguns sites não disponibilizam mídias por meio desse tipo de URL, então pode não detectar tudo.",
        "description": "The explanation of URL-based detection method shown in a tooltip."
    },
    "urlDetectionCheckbox": {
        "message": "Detecção via URL",
        "description": "The label of the checkbox to enable URL-based detection method."
    },
    "mimeDetectionExplain": {
        "message": "Detecção por verificar a resposta MIME do servidor (por exemplo, video/mp4, aplicativo/vnd.apple.mpegurl). É mais lento que a detecção de URL, pois o add-on precisa monitorar cada solicitação e resposta, mas é mais confiável.",
        "description": "The explanation of MIME-based detection method shown in a tooltip."
    },
    "mimeDetectionCheckbox": {
        "message": "Detecção via resposta MIME do servidor",
        "description": "The label of the checkbox to enable MIME-based detection method."
    },
    "downloadMethodTitle": {
        "message": "Método de download",
        "description": "The title of the download method section in the settings tab."
    },
    "browserDownloadExplain": {
        "message": "Baixe a mídia usando o gerenciador de downloads nativo do navegador. Rápido e lida com desconexões, mas só funciona em alguns sites e em alguns navegadores (Firefox para PC).",
        "description": "The explanation of native browser download method shown in a tooltip."
    },
    "browserDownloadCheckbox": {
        "message": "Download do navegador nativo",
        "description": "The label of the checkbox to enable native browser download method."
    },
    "fetchDownloadExplain": {
        "message": "Baixe a mídia usando a Fetch API. Funciona na maioria dos sites e navegadores, mas pode ser mais lento e não lida bem com desconexões.",
        "description": "The explanation of Fetch API download method shown in a tooltip."
    },
    "fetchDownloadCheckbox": {
        "message": "Fetch API",
        "description": "The label of the checkbox to enable Fetch API download method."
    },
    "streamDownloadTitle": {
        "message": "Preferência de download da stream",
        "description": "The title of the stream download preference section in the settings tab."
    },
    "streamFileDownloadExplain": {
        "message": "Baixe o arquivo de manifesto da stream (.m3u8, .mpd) diretamente. Você precisará de um reprodutor de mídia compatível com esses formatos (como o VLC) para visualizá-los. Downloads mais leves, mas você precisará estar online com um servidor funcionando para reproduzir o arquivo. Alguns servidores também bloqueiam a reprodução dessa forma.",
        "description": "The explanation of stream manifest download method shown in a tooltip."
    },
    "streamFileDownloadCheckbox": {
        "message": "Baixar manifesto da stream",
        "description": "The label of the checkbox to enable stream manifest download method."
    },
    "offlineDownloadExplain": {
        "message": "Converta a stream em um único arquivo de vídeo offline (.ts ou .zip) após o download. Isso exige mais tempo e espaço de armazenamento, mas o arquivo resultante pode ser assistido offline.",
        "description": "The explanation of offline video file download method shown in a tooltip."
    },
    "offlineDownloadChecbox": {
        "message": "Converter para arquivo de vídeo offline",
        "description": "The label of the checkbox to enable offline video file download method."
    },
    "streamQualityTitle": {
        "message": "Preferência de qualidade da stream",
        "description": "The title of the stream quality preference section in the settings tab."
    },
    "askStreamQualityExplain": {
        "message": "Sempre pergunte qual qualidade baixar ao baixar uma stream.",
        "description": "The explanation of 'Always ask' stream quality preference shown in a tooltip."
    },
    "askStreamQualityCheckbox": {
        "message": "Sempre me pergunte",
        "description": "The label of the radio button to enable 'Always ask' stream quality preference."
    },
    "highestStreamQualityExplain": {
        "message": "Sempre baixe a melhor qualidade disponível para uma stream. Qualidade melhor, mas arquivos maiores e downloads mais lentos.",
        "description": "The explanation of 'Always highest' stream quality preference shown in a tooltip."
    },
    "highestStreamQualityCheckbox": {
        "message": "Sempre a mais alta qualidade",
        "description": "The label of the radio button to enable 'Always highest' stream quality preference."
    },
    "lowestStreamQualityExplain": {
        "message": "Sempre baixe a qualidade mais baixa disponível para uma stream. Qualidade mais baixa, mas arquivos menores e downloads mais rápidos.",
        "description": "The explanation of 'Always lowest' stream quality preference shown in a tooltip."
    },
    "lowestStreamQualityCheckbox": {
        "message": "Sempre a mais baixa qualidade",
        "description": "The label of the radio button to enable 'Always lowest' stream quality preference."
    },
    "mpdFixExplain": {
        "message": "Isso modificará o arquivo .mpd que você baixa para incluir apenas a qualidade que você baixa. Caso contrário, players como o VLC não reproduzirão o arquivo porque tentarão solicitar uma qualidade que você não baixou.",
        "description": "The explanation of the MPD fix option shown in a tooltip."
    },
    "mpdFixCheckbox": {
        "message": "Corrigir arquivos MPD (recomendado)",
        "description": "The label of the checkbox to enable the MPD fix option."
    },
    "openPreference": {
        "message": "Preferência de abertura de add-on",
        "description": "The title of the add-on opening preference section in the settings tab."
    },
    "openPreferenceExplain": {
        "message": "Escolha como o add-on será aberto quando você clicar no ícone.",
        "description": "The explanation of the add-on opening preference."
    },
    "newTabCheckbox": {
        "message": "Abrir em nova aba",
        "description": "The label of the radio button to open the add-on in a new tab."
    },
    "newWindowCheckbox": {
        "message": "Abrir em nova janela",
        "description": "The label of the radio button to open the add-on in a new window."
    },
    "colorPickerTitle": {
        "message": "Cor da interface",
        "description": "The title of the interface color section in the settings tab."
    },
    "creditsTitle": {
        "message": "Créditos",
        "description": "The title of the credits section in the settings tab."
    },
    "creditsDescription1": {
        "message": "Media Downloader Unleashed!! é um ",
        "description": "The first part of the credits description."
    },
    "creditsDescription2": {
        "message": "projeto livre e de código aberto",
        "description": "The second part of the credits description."
    },
    "creditsDescription3": {
        "message": " feito por ",
        "description": "The third part of the credits description."
    },
    "creditsDescription4": {
        "message": "🦊 helloyanis",
        "description": "The fourth part of the credits description."
    },
    "creditsDescription5": {
        "message": ".",
        "description": "The fifth part of the credits description."
    },
    "rateButton": {
        "message": "Avaliar",
        "description": "The label of the button to rate the extension."
    },
    "shareButton": {
        "message": "Compartilhar",
        "description": "The label of the button to share the extension."
    },
    "donateButton": {
        "message": "Doar",
        "description": "The label of the button to donate to the developer."
    },
    "contactTitle": {
        "message": "Entre em contato comigo",
        "description": "The title of the contact section in the settings tab."
    },
    "contactDescription": {
        "message": "Caso tenha alguma dúvida, sugestão ou problema, fique à vontade para entrar em contato comigo!",
        "description": "The description of the contact section in the settings tab."
    },
    "emailButton": {
        "message": "E-mail",
        "description": "The label of the button to contact the developer via e-mail."
    },
    "mastodonButton": {
        "message": "Mastodon",
        "description": "The label of the button to contact the developer via Mastodon."
    },
    "mobileIncompatibleWarning": {
        "message": "⚠️ Esta opção não é compatível com alguns navegadores, como o Firefox para Android. Se você estiver usando este navegador, alterar a opção devolta.",
        "description": "The warning shown when the user enables an option that is not compatible with mobile browsers."
    },
    "permissionRequestTitle": {
        "message": "Permissão necessária",
        "description": "The headline of the permission request popup."
    },
    "permissionRequestDescription": {
        "message": "A extensão precisa de permissão para acessar todas as URLs para funcionar corretamente. Isso serve para detectar mídia de todos os sites. Seus dados de navegação são armazenados apenas no seu dispositivo e não são compartilhados com ninguém. Conceda a permissão ou, se você souber o que está fazendo e desejar armazenamento com escopo definido, pode ignorar este aviso.",
        "description": "The description of the permission request popup."
    },
    "grantPermissionButton": {
        "message": "Conceder permissão",
        "description": "The label of the button to grant the requested permission."
    },
    "denyPermissionButton": {
        "message": "Não me lembre",
        "description": "The label of the button to deny the requested permission."
    },
    "permissionGrantedMessage": {
        "message": "Permissão concedida com sucesso.",
        "description": "The message shown when the permission is granted successfully."
    },
    "permissionDeniedMessage": {
        "message": "Permissão negada. A extensão pode não funcionar como esperado.",
        "description": "The message shown when the permission is denied."
    },
    "permissionGrantFailedMessage": {
        "message": "Falha ao conceder permissão. A extensão pode não funcionar como esperado.",
        "description": "The message shown when the permission grant operation fails."
    },
    "mpdDownloadCompleteTitle": {
        "message": "Download de MPD concluído",
        "description": "The title of the notification shown when an MPD download is complete."
    },
    "mpdDownloadCompleteMessage": {
        "message": "O stream MPD foi baixado como um arquivo ZIP. Você pode extraí-lo e reproduzir o vídeo $BASENAME$.mpd com o VLC ou qualquer outro player compatível.",
        "description": "The message of the notification shown when an MPD download is complete.",
        "placeholders": {
            "BASENAME": {
                "content": "$1",
                "example": "video"
            }
        }
    },
    "splitDownloadWarningSnackbar": {
        "message": "Os fluxos de áudio e vídeo estão separados. Dois arquivos serão baixados.",
        "description": "The snackbar text that appears when an m3u8 stream with split audio and video starts to download"
    },
    "downloadingAudioSnackbar": {
        "message": "Baixando fluxo de áudio...",
        "description": "The snackbar text that appears when an m3u8 stream with split audio and video has the video portion downloaded and switches to downloading audio"
    },
    "splitAudioVideoDownloadCompleteTitle": {
        "message": "Fluxos de áudio e vídeo separados baixados",
        "description": "The title of the dialog shown when an m3u8 stream with split audio and video is downloaded."
    },
    "splitAudioVideoDownloadCompleteDescription": {
        "message": "Os fluxos de vídeo e áudio foram baixados separadamente. Você pode mesclá-los com <a href='https://ffmpeg.org/'>ffmpeg</a> usando o seguinte comando :<br/><code>ffmpeg -i $BASENAME$_video.ts -i $BASENAME$_audio.mp3 -c copy $BASENAME$.mp4</code>",
        "description": "The message of the dialog shown when an m3u8 stream with split audio and video is downloaded.",
        "placeholders": {
            "BASENAME": {
                "content": "$1",
                "example": "my_stream"
            },
            "VIDEOEXT": {
                "content": "$2",
                "example": ".mp4"
            }
        }
    },
    "videoQualityDialogTitle": {
        "message": "Selecionar qualidade do vídeo",
        "description": "The title of the dialog to select video quality when downloading a stream for MPD streams."
    },
    "videoQualitySelectLabel": {
        "message": "Qualidade do vídeo",
        "description": "The label of the quality selection dropdown in the video quality dialog for MPD streams."
    },
    "audioQualityDialogTitle": {
        "message": "Selecionar qualidade do áudio",
        "description": "The title of the dialog to select audio quality when downloading an stream for MPD streams."
    },
    "audioQualitySelectLabel": {
        "message": "Qualidade do áudio",
        "description": "The label of the quality selection dropdown in the audio quality dialog for MPD streams."
    },
    "streamQualityDialogTitle": {
        "message": "Selecionar qualidade do stream",
        "description": "The title of the dialog to select the stream quality when downloading an m3u8 stream."
    },
    "streamQualitySelectLabel": {
        "message": "Qualidade do stream",
        "description": "The label of the quality selection dropdown in the stream quality dialog for m3u8 streams."
    },
    "helpTooltip": {
        "message": "Abrir ajuda",
        "description": "The text of the tooltip shown when hovering over the button at the bottom left, to open the wiki page"
    },
        "diagnosticDataPermissionDenied": {
        "message": "Permissão para compartilhar dados de diagnóstico foi negada.",
        "description": "The message shown when the user denies permission to share diagnostic data."
    },
    "diagnosticDataSent": {
        "message": "Dados de diagnóstico foram enviados com sucesso. Obrigado por ajudar a melhorar a extensão!",
        "description": "The message shown when diagnostic data has been sent successfully."
    },
    "diagnosticDataSendError": {
        "message": "Ocorreu um erro ao enviar os dados de diagnóstico. Por favor, tente novamente mais tarde.",
        "description": "The message shown when there is an error sending diagnostic data."
    },
    "diagnosticDataEmailTitle": {
        "message": "Do you want me to contact you back about this issue?",
        "description": "The title of the prompt to enter an e-mail when sharing diagnostic data."
    },
    "diagnosticDataEmailDescription": {
        "message": "If so, please enter your e-mail address below. It will not be saved or shared to third parties. It will only be used to contact you back. If you don't want to be contacted, leave the field empty.",
        "description": "The description of the prompt to enter an e-mail when sharing diagnostic data."
    },
    "diagnosticDataEmailLabel": {
        "message": "E-mail address",
        "description": "The label of the text field to enter an e-mail when sharing diagnostic data."
    },
    "diagnosticDataEmailPlaceholder": {
        "message": "email@example.com",
        "description": "The placeholder of the text field to enter an e-mail when sharing diagnostic data."
    },
    "diagnosticDataEmailOkButton": {
        "message": "Submit",
        "description": "The text of the OK button in the prompt to enter an e-mail when sharing diagnostic data."
    },
    "noRequestFoundError": {
        "message": "Nenhuma solicitação encontrada para o tamanho selecionado",
        "description": "The error message shown when no request is found for the selected size."
    },
    "drmWarningTitle": {
        "message": "DRM Detected",
        "description": "The title of the warning shown when a DRM-protected MPD is detected."
    },
    "drmWarningDescription": {
        "message": "This MPD uses DRM (ContentProtection). It can be downloaded, but not played without decrypting the stream. Maybe you can get around this by setting your browser to deny DRM content (e.g. In Firefox: about:preferences#general → Digital Rights Management Content). But on some sites they won't load the media at all if DRM is disabled, so this has a low chance to work.",
        "description": "The description of the warning shown when a DRM-protected MPD is detected."
    },
    "drmWarningConntinueButton": {
        "message": "Continue",
        "description": "The text of the OK button in the DRM warning dialog."
    },
    "drmWarningCancelButton": {
        "message": "Cancel",
        "description": "The text of the Cancel button in the DRM warning dialog."
    }
}