{
    "actionTitle": {
        "message": "Télécharger les médias",
        "description": "The contents of the context menu when hovering over the extension icon."
    },
    "extensionDescription": {
        "message": "Téléchargez facilement des vidéos, des flux vidéos et des fichiers audios depuis la plupart des sites web, directement sur votre appareil!",
        "description": "The description of the extension shown in the browser's settings page."
    },
    "errorTitle1": {
        "message": "Quelque chose a mal tourné!",
        "description": "The 1st title of the error popup, randomly selects one of the titles when there is an error."
    },
    "errorTitle2": {
        "message": "Oups!",
        "description": "The 2nd title of the error popup."
    },
    "errorTitle3": {
        "message": "Oh oh!",
        "description": "The 3rd title of the error popup."
    },
    "errorTitle4": {
        "message": "Une erreur est survenue!",
        "description": "The 4th title of the error popup."
    },
    "errorTitle5": {
        "message": "Ca s'est cassé!",
        "description": "The 5th title of the error popup."
    },
    "errorTitle6": {
        "message": "Oh non!",
        "description": "The 6th title of the error popup."
    },
    "offlineError": {
        "message": "Le téléchargement a probablement échoué car vous êtes hors ligne. Veuillez vérifier votre connexion Internet et réessayer.",
        "description": "The error message shown when the user tries to download media while offline."
    },
    "reportIssue": {
        "message": "Aide sur cette erreur",
        "description": "The text of the link to report an issue in the error popup."
    },
    "okButton": {
        "message": "OK",
        "description": "The text of the OK button in the error popup."
    },
    "requestText": {
        "message": "Requête $METHOD$ depuis $SOURCE$ à $TIME$",
        "description": "The text showing which type of request is being made to load the media.",
        "placeholders": {
            "METHOD": {
                "content": "$1",
                "example": "GET"
            },
            "SOURCE": {
                "content": "$2",
                "example": "https://example.com/video.mp4"
            },
            "TIME": {
                "content": "$3",
                "example": "12:34"
            }
        }
    },
    "requestMethodUnknown": {
        "message": "inconnue",
        "description": "The text shown when the request method is not recognized."
    },
    "requestSourceUnknown": {
        "message": "une source inconnue",
        "description": "The text shown when the request source is not recognized."
    },
    "sizeText": {
        "message": "Taille",
        "description": "The text above the size selector in the media list."
    },
    "copyURL": {
        "message": "Copier l'URL",
        "description": "The text of the button to copy the media URL to clipboard."
    },
    "URLCopyError": {
        "message": "Echec lors de la copie de l'URL.",
        "description": "The error message shown when the URL copy operation fails."
    },
    "previewMedia": {
        "message": "Prévisualiser",
        "description": "The text of the preview button in the media list."
    },
    "downloadMedia": {
        "message": "Télécharger",
        "description": "The text of the download button in the media list."
    },
    "endOfMediaList": {
        "message": "C'est tout ce qui a été trouvé. Si vous ne voyez pas le média que vous cherchez, rafraichissez la page où il se trouve, lancez la lecture puis cliquez sur \"Actualiser liste\". Si il n'apparaît toujours pas, changez la méthode de détection dans les options. Pour plus d'aide, cliquez sur le bouton '?' en bas à gauche.",
        "description": "The text shown at the end of the media list."
    },
    "listLoadError": {
        "message": "Erreur lors de la récupération des requêtes de média : $ERROR$",
        "description": "The error message shown when the media list fails to load.",
        "placeholders": {
            "ERROR": {
                "content": "$1",
                "example": "Network error"
            }
        }
    },
    "listClearError": {
        "message": "Erreur lors de la suppression de la liste : $ERROR$",
        "description": "The error message shown when the media list fails to clear.",
        "placeholders": {
            "ERROR": {
                "content": "$1",
                "example": "Network error"
            }
        }
    },
    "unknownSize": {
        "message": "Taille inconnue",
        "description": "The text shown when the size of the media can't be parsed."
    },
    "downloadError": {
        "message": "Erreur lors du téléchargement : $ERROR$",
        "description": "The error message shown when the media download fails.",
        "placeholders": {
            "ERROR": {
                "content": "$1",
                "example": "Network error"
            }
        }
    },
    "homeTab": {
        "message": "Accueil",
        "description": "The name of the home tab in the popup."
    },
    "settingsTab": {
        "message": "Réglages",
        "description": "The name of the settings tab in the popup."
    },
    "clearListButton": {
        "message": "Supprimer la liste",
        "description": "The label of the button to clear the media list."
    },
    "refreshListButton": {
        "message": "Actualiser la liste",
        "description": "The label of the button to refresh the media list."
    },
    "detectionMethodTitle": {
        "message": "Méthode de détection",
        "description": "The title of the detection method section in the settings tab."
    },
    "needToRefreshListWarning": {
        "message": "⚠️ Vous devez actualiser la liste des médias pour appliquer le changement.",
        "description": "The warning shown below the detection method title in the settings tab."
    },
    "urlDetectionExplain": {
        "message": "Détection en se basant sur l'URL du média (par exemple .mp4, .m3u8, .mpd). Rapide mais moins fiable car certains sites utilisent des URL personnalisées sans extension.",
        "description": "The explanation of URL-based detection method shown in a tooltip."
    },
    "urlDetectionCheckbox": {
        "message": "Détection via l'URL",
        "description": "The label of the checkbox to enable URL-based detection method."
    },
    "mimeDetectionExplain": {
        "message": "Détection en se basant sur le type MIME renvoyé par le serveur. Plus fiable mais peut être plus lent car cela nécessite de lire toutes les requêtes et les réponses du navigateur.",
        "description": "The explanation of MIME-based detection method shown in a tooltip."
    },
    "mimeDetectionCheckbox": {
        "message": "Détection via le type MIME",
        "description": "The label of the checkbox to enable MIME-based detection method."
    },
    "downloadMethodTitle": {
        "message": "Méthode de téléchargement",
        "description": "The title of the download method section in the settings tab."
    },
    "browserDownloadExplain": {
        "message": "Télécharger le média en utilisant la méthode de téléchargement native du navigateur. Rapide et fiable, mais fonctionne uniquement sur certains sites, et ne fonctionne pas sur Firefox pour Android.",
        "description": "The explanation of native browser download method shown in a tooltip."
    },
    "browserDownloadCheckbox": {
        "message": "Téléchargement natif",
        "description": "The label of the checkbox to enable native browser download method."
    },
    "fetchDownloadExplain": {
        "message": "Télécharger le média en utilisant l'API Fetch. Fonctionne sur la plupart des sites, mais peut être plus lent et consommer plus de mémoire pour les gros fichiers. Les déconnexions ne sont pas gérées.",
        "description": "The explanation of Fetch API download method shown in a tooltip."
    },
    "fetchDownloadCheckbox": {
        "message": "API Fetch",
        "description": "The label of the checkbox to enable Fetch API download method."
    },
    "mediaCacheTitle": {
        "message": "Cache média",
        "description": "The title of the media cache section in the settings tab."
    },
    "mediaCacheExplain": {
        "message": "Tente de stocker la réponse média, afin que le téléchargement puisse se faire sans faire de requête au serveur. Les téléchargements seront plus rapides mais peuvent ralentir votre navigateur. Désactivez ceci si vous rencontrez des problèmes avec l'extension ou des pages qui se figent.",
        "description": "The explanation of the media cache option shown in a tooltip."
    },
    "mediaCacheCheckbox": {
        "message": "Activer le cache média",
        "description": "The label of the checkbox to enable media cache."
    },
    "hideSegmentsTitle": {
        "message": "Masquer les segments de streams",
        "description": "The title of the hide stream segments section in the settings tab."
    },
    "hideSegmentsExplain": {
        "message": "Les flux en direct utilisent plusieurs segments pour diffuser le contenu en petites parties. En général, vous n'avez besoin que du manifeste du flux, donc les segments peuvent être masqués pour réduire l'encombrement.",
        "description": "The explanation of the hide stream segments option shown in a tooltip."
    },
    "hideSegmentsCheckbox": {
        "message": "Masquer les segments de streams dans la liste des médias",
        "description": "The label of the checkbox to enable hiding stream segments in the media list."
    },
    "streamDownloadTitle": {
        "message": "Préférence de téléchargement des flux (streams)",
        "description": "The title of the stream download preference section in the settings tab."
    },
    "streamFileDownloadExplain": {
        "message": "Télécharger le manifeste du flux (fichier .m3u8 ou .mpd). Rapide et utilise peu de stockage, mais vous devrez utiliser un lecteur compatible avec les flux comme VLC. Certains sites bloquent également la lecture avec cette méthode.",
        "description": "The explanation of stream manifest download method shown in a tooltip."
    },
    "streamFileDownloadCheckbox": {
        "message": "Télécharger le manifeste",
        "description": "The label of the checkbox to enable stream manifest download method."
    },
    "offlineDownloadExplain": {
        "message": "Télécharger et convertir le flux en un fichier .ts (ou un dossier .zip pour les flux .mpd). Plus lent et utilise plus de stockage, mais le fichier peut être lu hors-ligne.",
        "description": "The explanation of offline video file download method shown in a tooltip."
    },
    "offlineDownloadChecbox": {
        "message": "Téléchargement hors-ligne",
        "description": "The label of the checkbox to enable offline video file download method."
    },
    "streamQualityTitle": {
        "message": "Préférence de qualité des flux",
        "description": "The title of the stream quality preference section in the settings tab."
    },
    "askStreamQualityExplain": {
        "message": "Toujours demander la qualité à télécharger pour chaque flux. Utile si vous voulez choisir la qualité en fonction du média ou de votre connexion.",
        "description": "The explanation of 'Always ask' stream quality preference shown in a tooltip."
    },
    "askStreamQualityCheckbox": {
        "message": "Toujours demander",
        "description": "The label of the radio button to enable 'Always ask' stream quality preference."
    },
    "highestStreamQualityExplain": {
        "message": "Toujours télécharger la meilleure qualité disponible pour un flux. Meilleure qualité mais fichiers plus gros et téléchargements plus lents.",
        "description": "The explanation of 'Always highest' stream quality preference shown in a tooltip."
    },
    "highestStreamQualityCheckbox": {
        "message": "Toujours la meilleure qualité",
        "description": "The label of the radio button to enable 'Always highest' stream quality preference."
    },
    "lowestStreamQualityExplain": {
        "message": "Toujours télécharger la qualité la plus basse disponible pour un flux. Fichiers plus petits et téléchargements plus rapides, mais qualité réduite.",
        "description": "The explanation of 'Always lowest' stream quality preference shown in a tooltip."
    },
    "lowestStreamQualityCheckbox": {
        "message": "Toujours la qualité la plus basse",
        "description": "The label of the radio button to enable 'Always lowest' stream quality preference."
    },
    "mpdFixExplain": {
        "message": "Ceci modifie le fichier MPD pour n'inclure que la qualité vidéo choisie, ce qui permet de lire le fichier avec VLC. Sinon, le fichier MPD inclut toutes les qualités et VLC ne peut pas le lire car il essaye de charger des qualités qui ne sont pas téléchargées.",
        "description": "The explanation of the MPD fix option shown in a tooltip."
    },
    "mpdFixCheckbox": {
        "message": "Corriger les fichiers MPD",
        "description": "The label of the checkbox to enable the MPD fix option."
    },
    "openPreference": {
        "message": "Préférence d'ouverture",
        "description": "The title of the add-on opening preference section in the settings tab."
    },
    "openPreferenceExplain": {
        "message": "Choisissez comment l'extension s'ouvre lorsque vous cliquez sur son icône.",
        "description": "The explanation of the add-on opening preference."
    },
    "newTabCheckbox": {
        "message": "Dans un nouvel onglet",
        "description": "The label of the radio button to open the add-on in a new tab."
    },
    "newWindowCheckbox": {
        "message": "Dans une nouvelle fenêtre",
        "description": "The label of the radio button to open the add-on in a new window."
    },
    "colorPickerTitle": {
        "message": "Couleur de l'interface",
        "description": "The title of the interface color section in the settings tab."
    },
    "creditsTitle": {
        "message": "Crédits",
        "description": "The title of the credits section in the settings tab."
    },
    "creditsDescription1": {
        "message": "Media Downloader Unleashed!! est un ",
        "description": "The first part of the credits description."
    },
    "creditsDescription2": {
        "message": "projet libre et open-source",
        "description": "The second part of the credits description."
    },
    "creditsDescription3": {
        "message": " créé par ",
        "description": "The third part of the credits description."
    },
    "creditsDescription4": {
        "message": "🦊 helloyanis",
        "description": "The fourth part of the credits description."
    },
    "creditsDescription5": {
        "message": ".",
        "description": "The fifth part of the credits description."
    },
    "rateButton": {
        "message": "Noter",
        "description": "The label of the button to rate the extension."
    },
    "shareButton": {
        "message": "Partager",
        "description": "The label of the button to share the extension."
    },
    "donateButton": {
        "message": "Faire un don",
        "description": "The label of the button to donate to the developer."
    },
    "contactTitle": {
        "message": "Me contacter",
        "description": "The title of the contact section in the settings tab."
    },
    "contactDescription": {
        "message": "Si vous avez des questions, des suggestions ou des problèmes, n'hésitez pas à me contacter !",
        "description": "The description of the contact section in the settings tab."
    },
    "emailButton": {
        "message": "E-mail",
        "description": "The label of the button to contact the developer via e-mail."
    },
    "mastodonButton": {
        "message": "Mastodon",
        "description": "The label of the button to contact the developer via Mastodon."
    },
    "mobileIncompatibleWarning": {
        "message": "⚠️ Cette option n'est pas compatible avec certains navigateurs mobiles, comme Firefox pour Android. Si vous utilisez ce navigateur, revenez en arrière.",
        "description": "The warning shown when the user enables an option that is not compatible with mobile browsers."
    },
    "permissionRequestTitle": {
        "message": "Permission requise",
        "description": "The title of the permission request dialog."
    },
    "permissionRequestDescription": {
        "message": "L'extension a besoin de la permission d'accéder à toutes les URL pour fonctionner correctement. Cela permet de détecter les médias sur tous les sites web. Vos données de navigation sont uniquement stockées sur votre appareil, et ne sont partagées avec personne. Veuillez accorder la permission, ou si vous savez ce que vous faites et souhaitez un stockage limité, vous pouvez ignorer cet avertissement.",
        "description": "The description of the permission request dialog."
    },
    "grantPermissionButton": {
        "message": "Accorder la permission",
        "description": "The label of the button to grant the permission."
    },
    "denyPermissionButton": {
        "message": "Ne pas accorder",
        "description": "The label of the button to deny the permission."
    },
    "permissionGrantedMessage": {
        "message": "Permission accordée avec succès.",
        "description": "The message shown when the permission is granted successfully."
    },
    "permissionDeniedMessage": {
        "message": "Permission refusée. L'extension peut ne pas fonctionner comme prévu.",
        "description": "The message shown when the permission is denied."
    },
    "permissionGrantFailedMessage": {
        "message": "Échec de l'octroi de la permission. L'extension peut ne pas fonctionner comme prévu.",
        "description": "The message shown when the permission grant fails."
    },
    "mpdDownloadCompleteTitle": {
        "message": "Téléchargement MPD terminé",
        "description": "The title of the notification shown when an MPD download is complete."
    },
    "mpdDownloadCompleteMessage": {
        "message": "Le flux MPD a été téléchargé en tant que fichier zip. Vous pouvez l'extraire et lire la vidéo $BASENAME$.mpd avec VLC ou n'importe quel autre lecteur compatible.",
        "description": "The message of the notification shown when an MPD download is complete.",
        "placeholders": {
            "BASENAME": {
                "content": "$1",
                "example": "video"
            }
        }
    },
    "splitDownloadWarningSnackbar": {
        "message": "Les flux audio et vidéo sont séparés. Deux fichiers seront téléchargés.",
        "description": "The snackbar text that appears when an m3u8 stream with split audio and video starts to download"
    },
    "downloadingAudioSnackbar": {
        "message": "Téléchargement du flux audio...",
        "description": "The snackbar text that appears when an m3u8 stream with split audio and video has the video portion downloaded and switches to downloading audio"
    },
    "splitAudioVideoDownloadCompleteTitle": {
        "message": "Téléchargement des flux audio et vidéo terminé.",
        "description": "The title of the dialog shown when an m3u8 stream with split audio and video is downloaded."
    },
    "splitAudioVideoDownloadCompleteDescription": {
        "message": "Les flux audio et vidéos ont été téléchargés séparément. Vous pouvez les fusionner avec <a href='https://ffmpeg.org/'>ffmpeg</a> en utilisant la commande suivante :<br/><code>ffmpeg -i \"$BASENAME$_video$VIDEOEXT$\" -i \"$BASENAME$_audio.mp3\" -c copy \"$BASENAME$.mp4\"</code>",
        "description": "The message of the dialog shown when an m3u8 stream with split audio and video is downloaded.",
        "placeholders": {
            "BASENAME": {
                "content": "$1",
                "example": "my_stream"
            },
            "VIDEOEXT": {
                "content": "$2",
                "example": ".mp4"
            }
        }
    },
    "videoQualityDialogTitle": {
        "message": "Choisir la qualité vidéo",
        "description": "The title of the dialog to select video quality when downloading a stream for MPD streams."
    },
    "videoQualitySelectLabel": {
        "message": "Qualité vidéo",
        "description": "The label of the quality selection dropdown in the video quality dialog for MPD streams."
    },
    "audioQualityDialogTitle": {
        "message": "Choisir la qualité audio",
        "description": "The title of the dialog to select audio quality when downloading an stream for MPD streams."
    },
    "audioQualitySelectLabel": {
        "message": "Qualité audio",
        "description": "The label of the quality selection dropdown in the audio quality dialog for MPD streams."
    },
    "streamQualityDialogTitle": {
        "message": "Choisir la qualité du flux",
        "description": "The title of the dialog to select the stream quality when downloading an m3u8 stream."
    },
    "streamQualitySelectLabel": {
        "message": "Qualité du flux",
        "description": "The label of the quality selection dropdown in the stream quality dialog for m3u8 streams."
    },
    "mediaPreviewSnackbar": {
        "message": "Si la vidéo ne charge pas, essayez de mettre la méthode de téléchargement sur \"Fetch\" dans l'onglet des options. C'est plus lent mais fonctionne avec plus de sites.",
        "description": "The snackbar shown when someone uses the preview mode for the first time."
    },
    "mediaPreviewDontRemindMe": {
        "message": "Ne plus me le rappeler",
        "description": "The action in the snackbar from above which will make it no longer show up."
    },
    "helpTooltip": {
        "message": "Ouvrir l'aide",
        "description": "The text of the tooltip shown when hovering over the button at the bottom left, to open the wiki page"
    },
    "diagnosticDataPermissionDenied": {
        "message": "La permission de partage de données de diagnostic a été refusée.",
        "description": "The message shown when the user denies permission to share diagnostic data."
    },
    "diagnosticDataSent": {
        "message": "Les données de diagnostic ont été envoyées avec succès. Merci de contribuer à l'amélioration de l'extension !",
        "description": "The message shown when diagnostic data has been sent successfully."
    },
    "diagnosticDataSendError": {
        "message": "Une erreur s'est produite lors de l'envoi des données de diagnostic. Veuillez réessayer plus tard.",
        "description": "The message shown when there is an error sending diagnostic data."
    },
    "diagnosticDataEmailTitle": {
        "message": "Voulez-vous que je vous recontacte à propos de ce problème?",
        "description": "The title of the prompt to enter an e-mail when sharing diagnostic data."
    },
    "diagnosticDataEmailDescription": {
        "message": "Dans ce cas, merci d'entrer votre e-mail ci dessous. Il ne sera pas sauvegardé ni partagé à des tiers et sera uniquement utilisé pour vous recontacter. Si vous ne souhaitez pas être recontacté, laissez le champ vide.<br/>Les données incluses dans votre signalement sont les suivantes : <br/><ul><li>Votre user agent (le vôtre est : <code>$USERAGENT$</code>)</li><li>L'URL de la page qui a causé l'erreur : <code>$REFERER$</code></li><li>L'URL du média : <code>$MEDIAURL$</code></li><li>L'erreur qui est survenue : <code>$ERROR$</code></li></ul>",
        "description": "The description of the prompt to enter an e-mail when sharing diagnostic data.",
        "placeholders": {
            "USERAGENT": {
                "content": "$1",
                "example": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36"
            },
            "REFERER": {
                "content": "$2",
                "example": "https://example.com/video_page"
            },
            "MEDIAURL": {
                "content": "$3",
                "example": "https://example.com/video.mp4"
            },
            "ERROR": {
                "content": "$4",
                "example": "Network error"
            }
        }
    },
    "diagnosticDataEmailLabel": {
        "message": "Adresse e-mail (facultatif)",
        "description": "The label of the text field to enter an e-mail when sharing diagnostic data."
    },
    "diagnosticDataEmailPlaceholder": {
        "message": "email@example.com",
        "description": "The placeholder of the text field to enter an e-mail when sharing diagnostic data."
    },
    "diagnosticDataEmailOkButton": {
        "message": "Envoyer",
        "description": "The text of the OK button in the prompt to enter an e-mail when sharing diagnostic data."
    },
    "diagnosticDataEmailCancelButton": {
        "message": "Annuler l'envoi",
        "description": "The text of the Cancel button in the prompt to enter an e-mail when sharing diagnostic data."
    },
    "noRequestFoundError": {
        "message": "Impossible de trouver les détails de la requête parmi l'historique de requêtes. Cela peut arriver quand la requête a déjà été effectuée et mise en cache dans votre navigateur avant l'installation de l'extension. Effacez les données de navigation du site web depuis lequel vous essayez de télécharger, puis redémarrez le navigateur et réessayez.",
        "description": "The error message shown when there is no request found for the selected size."
    },
       "drmWarningTitle": {
        "message": "DRM Detected",
        "description": "The title of the warning shown when a DRM-protected MPD is detected."
    },
    "drmWarningDescription": {
        "message": "Ce fichier MPD utilise un DRM (ContentProtection). Il peut être téléchargé, mais ne peut pas être lu sans déchiffrer le flux. Vous pouvez peut-être contourner cela en configurant votre navigateur pour refuser le contenu DRM (par exemple, dans Firefox : about:preferences#general → Gestion des droits numériques). Mais sur certains sites, les médias ne chargeront pas si le DRM est désactivé, donc cela a peu de chances de fonctionner.",
        "description": "The description of the warning shown when a DRM-protected MPD is detected."
    },
    "drmWarningConntinueButton": {
        "message": "Continuer",
        "description": "The text of the OK button in the DRM warning dialog."
    },
    "drmWarningCancelButton": {
        "message": "Annuler",
        "description": "The text of the Cancel button in the DRM warning dialog."
    },
    "ratingBannerText": {
        "message": "Si vous aimez cette extension, prenez un instant pour lui donner une note. Merci pour votre soutien !",
        "description": "The text shown in the rating banner."
    },
    "ratingBannerRateButton": {
        "message": "Noter maintenant",
        "description": "The label of the button to rate the extension in the rating banner."
    },
    "ratingBannerDismissButton": {
        "message": "Ignorer",
        "description": "The label of the button to dismiss the rating banner." 
    },
    "ratingBannerDontShowAgainButton": {
        "message": "Ne plus demander",
        "description": "The label of the button to not show the rating banner again."
    },
    "ratingBannerRemindMeLaterButton": {
        "message": "Me redemander dans une semaine",
        "description": "The label of the button to be reminded later in the rating banner."
    },
    "youtubeDialogAskTitle": {
        "message": "Voulez-vous télécharger depuis YouTube ?",
        "description": "The title of the dialog shown when a YouTube media request is detected."
    },
    "youtubeDialogAskMessage": {
        "message": "Le téléchargement depuis YouTube n'est pas pris en charge directement dans cette extension en raison des méthodes de streaming propriétaires de YouTube. Cependant, je peux vous guider vers des outils spécialisés dans le téléchargement de vidéos YouTube. Voulez-vous que je vous montre ces options ?<br/><mdui-checkbox id=\"youtube-dialog-dont-show-again\">Ne plus afficher ce message</mdui-checkbox>",
        "description": "The message of the dialog shown when a YouTube media request is detected."
    },
    "youtubeDialogAskOkButton": {
        "message": "Oui",
        "description": "The text of the OK button in the YouTube media request dialog."
    },
    "youtubeDialogDownloaderPCTitle": {
        "message": "Essayez avec yt-dlp",
        "description": "The title of the dialog shown when guiding the user to download YouTube videos on PC."
    },
    "youtubeDialogDownloaderPCMessage": {
        "message": "Vous pouvez utiliser yt-dlp, un puissant outil en ligne de commande pour télécharger des vidéos depuis YouTube et de nombreuses autres plateformes. Vous pouvez trouver les instructions d'installation sur leur page GitHub.",
        "description": "The message of the dialog shown when guiding the user to download YouTube videos on PC."
    },
    "youtubeDialogDownloaderAndroidTitle": {
        "message": "Essayez avec Seal",
        "description": "The title of the dialog shown when guiding the user to download YouTube videos on Android."
    },
    "youtubeDialogDownloaderAndroidMessage": {
        "message": "Vous pouvez utiliser Seal, une application Android qui vous permet de télécharger des vidéos depuis YouTube et d'autres plateformes. Vous pouvez trouver le lien de téléchargement sur leur page GitHub.",
        "description": "The message of the dialog shown when guiding the user to download YouTube videos on Android."
    }
}